<template>
  <div>
    <div class="uLabel">등록약관</div>
    <div
      @click.stop="dialog = true"
      class="box MT8 d-flex justify-space-between"
    >
      <div class="uFont">등록약관 자세히 보기</div>
      <div>
        <img src="~assets/images/icn-chevron-right.png" alt="다음" />
      </div>
    </div>
    <v-dialog v-model="dialog" max-width="600">
      <v-card>
        <v-btn @click="dialog = false" text class="mt-3 fixed">
          <v-icon>mdi-close</v-icon>
        </v-btn>
        <v-card-title class="d-flex justify-center aTitle"
          >공모전 등록약관</v-card-title
        >

        <v-card-text class="MT40 aContent">
          <span class="aBold">저작권에 관한 사항</span><br /><br />
          <span class="aBold">1.</span> 의뢰자(고객)와 참여자(디자이너)는
          ‘약관부록’ 중 ‘9.지적재산권’에 관한 아래의 내용에 관하여 반드시 숙지한
          후 그에 관한 동의여부를 결정하여 주시기 바랍니다.<br /><br />
          1) 참여자는 제3자의 저작권 등을 침해해서는 안되며, 만일 이를 위반하여
          의뢰자 또는 제3자에게 손해를 끼칠 경우에는 민·형사상의 모든 책임을
          지게 됩니다. 이는 공모전이 종료되어 이미 우승작으로 선정된 경우에도
          해당되는 것으로 저작권 침해 또는 이와 관련된 문제 발생 시 선정
          후에라도 취소가 가능하며, 이런 경우 회사는 우승작으로 선정된
          참여자에게 지급한 상금을 회수할 수 있습니다.<br /><br />
          2) 모든 공모전에 등록되는 참여자의 중간인도물, 사전작업물,
          최종인도물의 개별구성요소에 대한 지적재산권은 참여자에게 귀속되며,
          참여자의 허락 없이 사용할 수 없습니다.<br /><br />
          3) 참여자와 의뢰자 간의 지적재산권 양도 동의가 이루어진 우승작에 대한
          지적재산권은 의뢰자에게 양도되며, 지적재산권의 등록에 소요되는 비용은
          의뢰자가 부담합니다.<br /><br />
          4) 양도 후 우승작은 의뢰자의 소유이며, 공모전이 종료된 이후 참여자의
          승인 없이 사용할 수 있습니다.<br /><br />
          5) 공모전에 우승한 참여자와 그 우승작을 선정한 의뢰자는, 온라인 및
          오프라인상에서 캐릭터포유가 해당 우승작을 홍보를 위한 수단으로 로열티
          없이 자유롭고 지속적으로 사용하는 것을 승인합니다.<br /><br />
          6) 우승작은 캐릭터포유의 홍보를 목적으로 타 온라인 사이트 및 오프라인
          등을 통해 복사, 배포, 2차 저작물 제작 및 공개될 수 있습니다.<br /><br />
          7) 캐릭터포유는 디자인 및 아이디어의 침해와 관련된 그 어떤 요구나
          청구에 대하여 중재자 또는 조정자로 참여하지 않습니다.<br /><br />
          8) 캐릭터포유는 의뢰자 또는 참여자가 저지른 지적재산권 관련 침해, 위반
          등에 법적인 책임을 지지 않습니다.<br /><br />
          9) 캐릭터포유는 홈페이지 상에서 제3자의 지적재산권을 침해한 것으로
          판단되거나 침해 가능성이 존재하는 그 어떠한 콘텐츠를 자체적으로 삭제할
          수 있습니다.<br /><br /><br /><br />
          <span class="aBold">2.</span> 의뢰자와 참여자는 추후 우승작이 선정되어
          우승작에 관한 원본파일 전송 시 아래의 사항이 포함된 저작재산권
          양도계약을 체결하여야 하는바, 아래의 사항을 반드시 숙지한 후 그에 관한
          동의여부를 결정하여 주시기 바랍니다.<br /><br />
          1) 저작재산권의 양도 공모전에 출품된 응모작의 저작인격권은 저작자인
          응모자에게 원시적으로 귀속됩니다.<br />
          다만, 우승작으로 선정된 참여작은 사전에 공표한 상금 및 대금을 조건으로
          위 저작물에 대한 추가·변형권 등 2차적 저작물 작성권을 포함하는 일체의
          저작재산권과 위 저작물을 원저작물로 하는 2차적 저작물(현존하는 모든
          형태의 매체 및 장래의 새로운 매체에 의한 이용 등 모든 형태의 2차적
          저작물을 의미함) 또는 위 저작물을 구성 부분으로 하는 편집 저작물을
          작성하여 이용할 권리 전부를 영구적으로 의뢰자에게 양도합니다.<br /><br />
          1-1). 우승작품에 스톡 컨텐츠가 포함된 경우, 아래의 부분적 조건에 따라
          저작재산권 양도계약을 체결하여야 하며, 디자이너는 스톡 컨텐츠 사용
          여부를 사전에 분명하게 고지하여야 합니다.<br />
          ① 모든 컨텐츠들은 원본 라이선스 규정에 따라 사용되어야 합니다.
          디자이너 및 의뢰인 모두는 원본의 라이선스 및 이용범위에 근거하여
          결과물을 활용하여야 합니다.<br />
          ② 스톡 컨텐츠를 활용한 디자인 결과물의 경우, 그 원본 스톡 소스에 대한
          저작권은 일체 양도가 불가능합니다.<br />
          ③ 위 ②의 사유로, 저작물의 사용권을 양도받은 의뢰인은 스톡 컨텐츠가
          제외된 영역에 대해서만 수정 및 활용을 할 수 있습니다.<br />
          ④ 의뢰인이 부득이하게 스톡 이미지 영역의 원본 수정이 필요한 경우,
          의뢰인 측에서 해당 스톡 이미지 업체 측에 허락을 구하여야 합니다.<br />
          ⑤ 디자이너는 유료 스톡 컨텐츠 사용 유무를 사전에 고지하는 의무와 함께
          스톡 원본 이미지를 병합하여 전달하는 의무를 집니다.<br />
          제작물에 사용된 스톡 이미지 저작물은 일체 원본 전송이 불가능합니다.<br />
          ⑥ 모든 캐릭터 공모전에는 유료 스톡 콘텐츠가 활용될 수 없습니다.<br /><br />
          1-2). 저작재산권이 아닌 저작인격권에 관한 사항은 우승자에게
          귀속됩니다. 다만, 캐릭터포유 홈페이지를 통한 거래 건에 한해
          저작재산권을 양도받은 의뢰자가 동의하지 않을 경우, 우승자가 개인적인
          용도로 외부에 노출하는 행위(포트폴리오 및 SNS 업로드 등)를 일절
          금지합니다.<br /><br />
          2) 저작재산권의 (이전)등록<br /><br />
          우승작으로 선정된 참여자는 위 저작물에 대하여 저작재산권 (이전)등록을
          할 수 있으며, 우승작으로 선정된 참여자는 (이전)등록에 필요한 서류 등을
          의뢰자에게 제공하는 등 이에 지체 없이 협력하여야 합니다.<br /><br /><br /><br />
          3) 배타적 이용<br /><br />
          우승작으로 선정된 참여자는 위 저작물의 전부 또는 일부와 동일 또는
          유사한 저작물을 제3자에게 이용하게 하거나 설정계약 등을 해서는
          안됩니다.<br /><br /><br /><br />
          4) 저작재산권의 권리 변동 사항<br /><br />
          우승작으로 선정된 참여자는 본 계약 이전에 위 저작물에 대하여 제3자에게
          질권을 설정하였거나 위 저작물에 관한 창작 작업을 제3자와 공유한 사실이
          없고, 저작재산권의 일부 또는 전부를 양도하였거나 이용허락을 한 사실이
          있어서는 안됩니다.<br /><br /><br /><br />
          5) 저작재산권 양도대금<br /><br />
          ① 의뢰자는 우승작으로 선정된 참여자에게 위 1)항에 의하여 위 저작물의
          저작재산권 전부를 양도하는 대가로 상금 및 대금을 지급합니다.<br />
          ② 위 제1항의 양도대금은 캐릭터포유가 의뢰자로부터 지급받아, 그
          양도대금에서 원천징수 소득세(3.3%), 캐릭터포유 서비스 운영에 대한
          수수료(16.7%) 및 참여보상(10%)를 공제한 후, 그 나머지를 우승작으로
          선정된 참여자에게 지급합니다.<br /><br /><br /><br />
          6) 성명표시권<br /><br />
          우승작으로 선정된 참여자는 의뢰인이 위 저작물을 공표하거나 위 1)항에서
          규정하고 있는 위 저작물에 대한 2차적 저작물 내지 편집저작물을 공표하는
          경우, 위 저작물 또는 2차적 저작물 내지 편집저작물의 저자로 우승작으로
          선정된 참여자를 표시합니다. 다만, 저작물의 성질이나 그 이용의 목적 및
          형태 등에 비추어 부득이하거나 저작물을 로고, 제품, 패키지, 포스터,
          웹사이트, 어플 등 상업적 용도로 사용하는 경우, 통상적으로 저자를
          표시하지 않는 경우라고 인정되는 때에는 그 저자표시를 생략할 수
          있습니다.<br /><br /><br /><br />
          7) 계약의 해석 및 보완<br /><br />
          ① 본 계약서에 명시되어 있지 아니 하거나 해석상 이견이 있을 경우에는
          저작권법, 민법 등을 준용하고 사회 통념과 조리에 맞게 해결합니다.<br />
          ② 각 항을 위반하거나 협력의무를 불이행한 경우에 발생한 분쟁 및 손해에
          관해 의뢰자나 참여자는 관련법령에 의거하여 배상의 책임을 질 수
          있습니다.<br /><br />
        </v-card-text>
      </v-card>
    </v-dialog>
  </div>
</template>

<script>
export default {
  data() {
    return {
      dialog: false
    }
  }
}
</script>

<style lang="scss" scoped>
.MT8 {
  margin-top: 8px;
}

.uLabel {
  font-family: 'Noto Sans KR', sans-serif;
  font-size: 14px;
  color: #666666;
  font-weight: 500;
}

.uFont {
  font-family: 'Noto Sans KR', sans-serif;
  font-size: 14px;
  line-height: 1.43;
  color: #222222;
}

.box {
  width: 400px;
  border: 1px solid #d8d8d8;
  border-radius: 5px;
  padding: 14px 22px;
}

.aTitle {
  font-family: 'Noto Sans KR', sans-serif;
  font-size: 22px;
  font-weight: bold;
  color: #151515;
}

.aContent {
  width: 400px;
  left: 0;
  right: 0;
  margin: 40px auto 0 auto;
  font-family: 'Noto Sans KR', sans-serif;
  font-size: 14px;
  color: #222222;
}

.aBold {
  font-weight: bold;
}

.fixed {
  position: fixed;
}
</style>
